app/Controllers/Inventario.php

    public function index() { //metodo que muestra la tabla
        $productoModel= new ProductoModel (); //instancia del modelo para usar el metodo findAll
        $datos['productos']= $productoModel->findAll();  //array asociativo con los datos que se van a mostrar en la vista
---
SELECT *
FROM `productos`

    public function guardar() { //metodo que recibe los datos y los guarda
        $productoModel= new ProductoModel (); //instancia del modelo para usar el metodo insert
        $datos= [  //array asociativo con los datos que se van a guardar
            'codigo_productos'=> $this->request->getPost('codigo_productos'),
            'nombre_productos'=> $this->request->getPost('nombre_productos'),
            'precio_productos'=> $this->request->getPost('precio_productos'),
            'stock_actual'=> $this->request->getPost('stock_actual'),
            'estado'=> 1


        ];

        if ($productoModel->insert($datos)){ // si se guarda correctamente, redirige a la lista de productos
---
INSERT INTO `productos` (`codigo_productos`, `nombre_productos`, `precio_productos`, `stock_actual`) VALUES ('ebdhb', 'juego', '299', '1')

    public function borrar($id){
        $productoModel = new ProductoModel();
        if ($productoModel->find($id)) {
            $productoModel->delete($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '17'
DELETE FROM `productos`
WHERE `id` IN ('17')

    public function comprar($id){
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($id);

        if ($producto){
            if($producto['stock_actual']> 0){
                $nuevoStock = $producto['stock_actual'] - 1;
                $productoModel->update($id, ['stock_actual' => $nuevoStock]);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '17'
UPDATE `productos` SET `stock_actual` = 0
WHERE `productos`.`id` IN ('17')